
## Plan Result

[CI link](https://github.com/koyashiro/infra/actions/runs/8724205396)


<pre><code>Plan: 11 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.cname_vpm
  * cloudflare_record.mx_alt1
  * cloudflare_record.mx_alt2
  * cloudflare_record.mx_alt3
  * cloudflare_record.mx_alt4
  * cloudflare_record.mx_primary
  * cloudflare_record.txt_discord
  * cloudflare_record.txt_google_domainkey
  * cloudflare_record.txt_google_suite_verification
  * cloudflare_record.txt_keybase_site_verification
  * cloudflare_record.txt_spf


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.cname_vpm will be created
  + resource "cloudflare_record" "cname_vpm" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "vpm"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "vpm-repos.pages.dev"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_alt1 will be created
  + resource "cloudflare_record" "mx_alt1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt1.aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_alt2 will be created
  + resource "cloudflare_record" "mx_alt2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt2.aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_alt3 will be created
  + resource "cloudflare_record" "mx_alt3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt3.aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_alt4 will be created
  + resource "cloudflare_record" "mx_alt4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt4.aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_primary will be created
  + resource "cloudflare_record" "mx_primary" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 1
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_discord will be created
  + resource "cloudflare_record" "txt_discord" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_discord"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "dh=2f7777c55cca3b5519378571f05bd3979da45d38"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_google_domainkey will be created
  + resource "cloudflare_record" "txt_google_domainkey" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAyhioqL5nv/wDnkrmguw+J1qpm2fsLev+PKZMVVCLuGurD/6UJUscAFRN5xpjbP4DOsTmQtP/pTj8M0+9DkRItkuJUGCb9U9DMi3MN2Ll9BAaEfKFUDg9OEudIW/kWBhawkQpKA1DREu/bnZPr8VvwcyrO+DhPRUHYsylEPWrCY8EdDSv4U/m4a2kc79l1aJLo3iC542LStRNw70ls8hKHWC8+49vup2FFWFn9ktSgQs21A5hDY+VB/vEnpqCyN8R+VP0q5QgmAxvwWtfGQ11kIE82+p6OOI2RNPHYt5wHlPtmyZCZh28l3PRrdzXXOJiV9KvC9FuAvJmHUuu9OoF5wIDAQAB"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_google_suite_verification will be created
  + resource "cloudflare_record" "txt_google_suite_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "google-site-verification=7-AYDWnsMkam_BpKeKWqjbeTqglhrp80t1N4RtKg6gQ"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "keybase-site-verification=fFkMCr9xX06WBiCVODi28op8DCxmwfcYIN-iFSqEiwk"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "v=spf1 include:koyashiro.net ~all"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":141,"Program":"tfcmt","SHA1":"71413a7f74cbfe2df69cdb93a02a6501d3dc3174","Vars":{},"WorkflowName":"terraform"} -->